Revit 2027 API
TableCellStyle.BorderTopLineStyle Property
 The element id (GraphicsStyle element) for the top line of the cell border.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId BorderTopLineStyle { get; set; }
Public Property BorderTopLineStyle As ElementId
	Get
	Set
public:
property ElementId^ BorderTopLineStyle {
	ElementId^ get ();
	void set (ElementId^ value);
}
member BorderTopLineStyle : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
TableCellStyle Class
Autodesk.Revit.DB Namespace